index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Daniele Moser</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Daniele Moser">
<meta name="description" content="Me medesimo meco"
>
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css"/>
</head>
<body>
<div id="preamble" class="status">
<header>
    <nav>
        <a href="/index.html">Home</a>
        <a href="/articles/index.html">Blog</a>
        <a href="/index.html">CV</a>
    </nav>
</header>
</div>
<div id="content">
<header>
<h1 class="title">Daniele Moser</h1>
</header>
<main id="outline-container-orgf8e3964" class="outline-2">
<h2 id="orgf8e3964">🙋‍♂️ Who am I</h2>
<div class="outline-text-2" id="text-orgf8e3964">
<p>
Hi, I'm Daniele, I'm a 22 year old guy based in Trentino, Italy. I work as an electronic
designer and embedded software developer in
<a href="http://www.leos-instruments.com">LEOS</a> where my daily work consists
of production management of the electronics which control lasers for
spectroscopy purposes (you can find more info in the <a href="#org72a3f99">work section</a>).
</p>

<p>
In my free time, you can find me running in the mountains, growing new
technical skills but most importantly being a volunteer firefighter 🚒.
</p>
</div>
</main>

<main id="outline-container-org550d677" class="outline-2">
<h2 id="org550d677">🛠️ Technical knowledge</h2>
<div class="outline-text-2" id="text-org550d677">
<p>
My technical skills are all centered around electronics and programming.
</p>
</div>

<div id="outline-container-orge90f77b" class="outline-3">
<h3 id="orge90f77b">💡 Electronics</h3>
<div class="outline-text-3" id="text-orge90f77b">
<p>
I studied electronics and automation in high school, after that I took a
2-year course in automation and mechatronics, where I also found interests in
production management and lean production methods.
Here are some skills I know:
</p>
<ul class="org-ul">
<li>PCB design, mostly done with KiCad</li>
<li>PCB production and production management</li>
<li>SMD and THT soldering</li>
<li>Embedded boards programming</li>
</ul>
</div>
</div>

<div id="outline-container-org4bb0ff2" class="outline-3">
<h3 id="org4bb0ff2">🖥️ Informatics</h3>
<div class="outline-text-3" id="text-org4bb0ff2">
<p>
I have always found the IT world to be fascinating, as a fact I spend lot of my free
time discovering new things on this subject. I am also a fan of open source
software and anything that revolves around it, and I always try to find open
source alternatives to get my job done.
These below are some tools and programs I learned in my lifetime:
</p>
<ul class="org-ul">
<li>Linux</li>
<li>Git</li>
<li>KiCad</li>
<li>C for embedded systems</li>
<li>Latex</li>
<li>Python</li>
</ul>
</div>
</div>
</main>

<main id="outline-container-org587d05b" class="outline-2">
<h2 id="org587d05b">🎓 Education</h2>
<div class="outline-text-2" id="text-org587d05b">
</div>
<div id="outline-container-org8d5077b" class="outline-3">
<h3 id="org8d5077b">High school degree in Electronics and Automation (2015 - 2018)</h3>
<div class="outline-text-3" id="text-org8d5077b">
<p>
I graduated in 2018 in Electronics and Automation, my thesis was about a project
of a Rubik's cube solver, where I covered most of the electronics and programming.
</p>
</div>
</div>

<div id="outline-container-org95415e1" class="outline-3">
<h3 id="org95415e1">Alta Formazione Professionale in Mechatronics and Automation (2018 - 2020)</h3>
<div class="outline-text-3" id="text-org95415e1">
<p>
I also took a 2 year course in Mechatronics and Automation. This course
alternates lessons with 8 months of internship (you can find more info in
the <a href="#orgb623c30">work section</a>) so not only studying is involved but I also managed to build
some work experience.
</p>

<p>
My thesis revolved around the digitization process of the production facility
and lean production methods used in the factory.
</p>
</div>
</div>
</main>

<main id="outline-container-org545d338" class="outline-2">
<h2 id="org545d338">👨‍💻 Work experience</h2>
<div class="outline-text-2" id="text-org545d338">
</div>
<div id="outline-container-orgb48d3da" class="outline-3">
<h3 id="orgb48d3da">LEOS S.r.l. (January 2021 - today) <a id="org72a3f99"></a></h3>
<div class="outline-text-3" id="text-orgb48d3da">
<p>
I am currently working in a production environment where I manage the production
and quality assurance of the electronics which control laser heads used for
spectroscopy purposes. 
</p>
</div>
</div>

<div id="outline-container-orgf661313" class="outline-3">
<h3 id="orgf661313">BLM group (8 months in 2019 - 2020) <a id="orgb623c30"></a></h3>
<div class="outline-text-3" id="text-orgf661313">
<p>
I worked as a intern in Adige S.p.a. where I performed various tasks in the
production facility of laser cutting machinery. The tasks include:
</p>
<ul class="org-ul">
<li>Inventory management</li>
<li>Production of mechanical pieces with CNC machines</li>
<li>Followed the full production start to finish (both mechanical and electric) of
a laser tube-cutting machine</li>
</ul>

<p>
Most importantly, I followed the digitization process of the production
facility, which aimed to better estimate the production status of each machine.
Furthermore I took part in the realization of a proof of concept of
digitization of the building procedures.
</p>
</div>
</div>

<div id="outline-container-orgd3563b9" class="outline-3">
<h3 id="orgd3563b9">ACE control systems LTD (August 2017)</h3>
<div class="outline-text-3" id="text-orgd3563b9">
<p>
I worked as an intern in Ireland which was part of a school project. I worked in
a workshop mostly doing cabling of electrical cabinets.
</p>
</div>
</div>

<div id="outline-container-org9f4e1df" class="outline-3">
<h3 id="org9f4e1df">Tretec S.r.l. (June 2017)</h3>
<div class="outline-text-3" id="text-org9f4e1df">
<p>
I worked as an intern in a PCB production company, where I learned the
basics of THT and SMD soldering. Furthermore this was the first time I managed
to see the production and testing process of PCBs.
</p>
</div>
</div>
</main>

<main id="outline-container-org1418363" class="outline-2">
<h2 id="org1418363">📧 Contacts</h2>
<div class="outline-text-2" id="text-org1418363">
<ul class="org-ul">
<li>Email: <a href="mailto:dnlmsr0@gmail.com">dnlmsr0@gmail.com</a></li>
<li>LinkedIn: <a href="https://www.linkedin.com/in/dan-mos">dan-mos</a></li>
<li>GitHub: <a href="https://github.com/dnlmsr">dnlmsr</a></li>
</ul>
</div>
</main>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniele Moser</p>
<p class="validation"></p>
</div>
</body>
</html>
